Tekla.Structures.Datatype.Angle.UnitType
The angle units.

Tekla.Structures.Datatype.Angle.UnitType.Degrees
Represents an angle in degrees, with 0 degrees representing the empty angle and 360 the full angle

Tekla.Structures.Datatype.Angle.UnitType.Radians
Represents an angle in radians, with 0 radians representing the empty angle and 2*PI the full angle